Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/АР_ОбщиеПроцедурыКлиентСервер/Ext/Module.bsl
Процедура РассчитатьСумму(СтрокаТабличнойЧасти, ПараметрыОбъекта) Экспорт
	
	
	Если ПараметрыОбъекта.Свойство("ЭтоДепозит") Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	ИначеЕсли ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) И ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(СтрокаТабличнойЧасти.Номенклатура, "АР_ПостояннаяЧастьОплаты") Тогда
		//РассчитатьСтрокуНачисления(СтрокаТабличнойЧасти, ПараметрыОбъекта.НачалоПериода, ПараметрыОбъекта.ОкончаниеПериода);
		АР_ОбщиеПроцедуры.РассчитатьСтрокуНачисления_(СтрокаТабличнойЧасти, ПараметрыОбъекта.НачалоПериода, ПараметрыОбъекта.ОкончаниеПериода, ПараметрыОбъекта);
	Иначе
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.СтавкаСпособаНачисления * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	АР_ОбщиеПроцедуры.ПересчитатьПоКурсуПриИзмененииСвязанногоПоля(СтрокаТабличнойЧасти, ПараметрыОбъекта, "Сумма");
	
	ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ПараметрыОбъекта.СуммаВключаетНДС);
	
КонецПроцедуры

Процедура РассчитатьСтрокуНачисления(Стр, НачалоПериода, ОкончаниеПериода)
	
	КоличествоВремени = Стр.КоличествоДней;
	КоличествоДнейВГоду = ДеньГода(КонецГода(НачалоПериода));
	ПериодНачисления = ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Стр.СпособНачисления, "ПериодНачисления");
	Если ПериодНачисления = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если НачалоПериода = НачалоМесяца(НачалоПериода) И 
			ОкончаниеПериода = НачалоДня(КонецМесяца(ОкончаниеПериода)) Тогда
			//в этом случае считаем что Сумма = Площадь*Ставка/12
			КоличествоВремениПриведенное = 1/12;
		Иначе
			КоличествоВремениПриведенное = КоличествоВремени/КоличествоДнейВГоду;
		КонецЕсли;
		
	ИначеЕсли ПериодНачисления = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		КоличествоВремениПриведенное = КоличествоВремени/(КоличествоДнейВГоду/2);
	ИначеЕсли ПериодНачисления = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		КоличествоВремениПриведенное = КоличествоВремени/(КоличествоДнейВГоду/4);
	ИначеЕсли ПериодНачисления = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		Если АР_ОбщиеПроцедуры.ИспользоватьСреднийМесяц() Тогда
			СреднийМесяц = АР_ОбщиеПроцедуры.ПолучитьСреднийМесяц();
			Если Не ЗначениеЗаполнено(СреднийМесяц) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задано значение константы ""Средний месяц""!");
				КоличествоВремениПриведенное = 0;	
			Иначе
				КоличествоВремениПриведенное = КоличествоВремени/СреднийМесяц;
			КонецЕсли;
		Иначе
			КоличествоВремениПриведенное = КоличествоВремени/День(КонецМесяца(НачалоПериода));
		КонецЕсли;
		
	ИначеЕсли ПериодНачисления = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		КоличествоВремениПриведенное = КоличествоВремени/7;
	ИначеЕсли ПериодНачисления = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		КоличествоВремениПриведенное = КоличествоВремени;
	Иначе
		КоличествоВремениПриведенное = КоличествоВремени;
	КонецЕсли;
	
	Результат = Стр.СтавкаСпособаНачисления * Стр.Количество * КоличествоВремениПриведенное;
	Стр.Сумма = Результат;
	
КонецПроцедуры


//+са
Процедура ПереключитьТекущуюСтраницуВыбораПериода(ВидПериода, Страницы, ПараметрыСтраниц = Неопределено) Экспорт
	
	Если ПараметрыСтраниц = Неопределено Тогда
		ПараметрыСтраниц = Новый Структура;
		ПараметрыСтраниц.Вставить("ПроизвольныйПериод", "ГруппаПроизвольныйПериод");
		ПараметрыСтраниц.Вставить("ПериодПоВидам"     , "ГруппаПериодПоВидам");
		ПараметрыСтраниц.Вставить("День"              , "ГруппаДень");
	КонецЕсли;
	
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы[ПараметрыСтраниц.ПроизвольныйПериод];
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы[ПараметрыСтраниц.День];
	Иначе
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы[ПараметрыСтраниц.ПериодПоВидам];
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруОтбораСписка(КоллекцияЭлементовОтбора) Экспорт
	
	СтруктураОтбора = Новый Структура;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.Использование Тогда
			
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда 
				
				СтруктураОтбора.Вставить(Строка(ЭлементОтбора.ЛевоеЗначение), ЭлементОтбора.ПравоеЗначение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураОтбора;
	
КонецФункции

// + NAI Becar Конюшок С.Н. от 15.12.2016 13:59
&НаКлиенте
Процедура ЗапускМониторингаАктивностиТекПользователя() Экспорт
	
	ПодключитьОбработчикОжидания("ПроверкаАктивностиТекущегоСеанса", 600, Ложь);

КонецПроцедуры
